<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of InVisionSync.</string>
		<key>Identifier</key>
		<string>com.github.benmartel.download.InVisionSync</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>InVisionSync</string>
			<key>SPARKLE_FEED_URL</key>
			<string>https://projects.invisionapp.com/native_app/mac/sparkle/appcast_v2.xml</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>SparkleUpdateInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>appcast_url</key>
					<string>%SPARKLE_FEED_URL%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.zip</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/Applications</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
	</dict>
</plist>